#Область ПрограммныйИнтерфейс

// Возвращает обработку с контекстом и методами наполнения контекста запроса
//
// Параметры:
//   ИсточникДанных - Строка - таблица для получения данных
//   Первые         - Число  - ограничение количества выборки
//   Различные      - Булево - признак получения неповторяющихся значений
//   Разрешенные    - Булево - признак ограничения выборки с применением RLS
//
// Возвращаемое значение:
//   ОбработкаОбъект.СЗ_ПроцессорСхемЗапроса - менеджер для серверного формирования запроса
//   ФормаКлиентскогоПриложения - менеджер для клиентского формирования запросов
//
Функция НовыйПроцессорСхемЗапроса(ИсточникДанных, Первые = 0, Различные = Ложь, Разрешенные = Ложь) Экспорт
	
	#Если Клиент Тогда
		ПроцессорСхемЗапроса = ПолучитьФорму("Обработка.СЗ_ПроцессорСхемЗапроса.Форма.Форма");
	#Иначе
		ПроцессорСхемЗапроса = Обработки.СЗ_ПроцессорСхемЗапроса.Создать();
	#КонецЕсли
	
	ПроцессорСхемЗапроса.УстановитьИсточникДанных(ИсточникДанных, Первые, Различные, Разрешенные);
	
	Возврат ПроцессорСхемЗапроса;
	
КонецФункции

#КонецОбласти
