#Область ПрограммныйИнтерфейс

Функция НовыйПроцессорСхемЗапроса(ИсточникДанных, Первые = 0, Различные = Ложь, Разрешенные = Ложь) Экспорт
	
	#Если Клиент Тогда
		ПроцессорСхемЗапроса = ПолучитьФорму("Обработка.СЗ_ПроцессорСхемЗапроса.Форма.Форма");
	#Иначе
		ПроцессорСхемЗапроса = Обработки.СЗ_ПроцессорСхемЗапроса.Создать();
	#КонецЕсли
	
	ПроцессорСхемЗапроса.УстановитьИсточникДанных(ИсточникДанных, Первые, Различные, Разрешенные);
	
	Возврат ПроцессорСхемЗапроса;
	
КонецФункции

#КонецОбласти
