
Функция НовыйЗапрос(ИсточникДанных, Первые = 0, Различные = Ложь, Разрешенные = Ложь) Экспорт
	
	ПроцессорСхемЗапроса = СЗ_ПроцессорыСхемЗапросаКлиентСервер
		.НовыйПроцессорСхемЗапроса(ИсточникДанных, Первые, Различные, Разрешенные);
	
	Возврат ПроцессорСхемЗапроса;
	
КонецФункции

Функция Предикат() Экспорт
	
	ПроцессорПредикатов = СЗ_ПроцессорыПредикатовКлиентСервер
		.НовыйПроцессорПредикатов();
	
	Возврат ПроцессорПредикатов;
	
КонецФункции

// TODO: В модуле СЗ_ПроцессорыСхемЗапросаКлиентСерверСлужебный так же регулярно требуетс
//       такая структура. Рефакторинг!
Функция НовоеПоле(ИмяПоля, Источник, Псевдоним) Экспорт
	
	Возврат Новый Структура("ИмяПоля, Источник, Псевдоним",
		ИмяПоля, Источник, Псевдоним);
	
КонецФункции