
#Область ПрограммныйИнтерфейс

// Устанавливает имя реквизита, все последующие условия будут относится к нему
//
// Параметры:
//   Предикат     - 
//   ИмяРеквизита - Строка - имя реквизита
//
Процедура УстановитьИмяРеквизита(Предикат, ИмяРеквизита) Экспорт
	
	Если Предикат = Неопределено Тогда
		Предикат = Новый Структура("ИмяРеквизита, Условия",
			"", Новый Массив);
	КонецЕсли;
	
	Предикат.ИмяРеквизита = ИмяРеквизита;
	
КонецПроцедуры

// Устанавливает вид и значение сравнения для условия
//
// Параметры:
//   Предикат     - ОбработкаОбъект.СЗ_ПроцессорПредикатов - 
//                - ФормаКлиентскогоПриложения             - 
//   ВидСравнения - Строка                                 - 
//   Значение     - Производьный                           - 
//
Процедура УстановитьПредикат(Предикат, ВидСравнения, Значение) Экспорт
	
	Если Предикат = Неопределено Или ПустаяСтрока(Предикат.ИмяРеквизита) Тогда
		ВызватьИсключение "Ошибочный порядок вызова функций формирования предиката";
	КонецЕсли;
	
	Условие = Новый Структура("ИмяРеквизита, ВидСравнения, Значение",
		Предикат.ИмяРеквизита, ВидСравнения, Значение);
		
	Предикат.Условия.Добавить(Условие);
	
КонецПроцедуры

#КонецОбласти
