
#Область ПрограммныйИнтерфейс

//
//
// Параметры:
//   Предикат     - 
//   ИмяРеквизита - 
//
Процедура УстановитьИмяРеквизита(Предикат, ИмяРеквизита) Экспорт
	
	Если Предикат = Неопределено Тогда
		Предикат = Новый Структура("ИмяРеквизита, Условия",
			"", Новый Массив);
	КонецЕсли;
	
	Предикат.ИмяРеквизита = ИмяРеквизита;
	
КонецПроцедуры

//
//
// Параметры:
//   Предикат     - 
//   ВидСравнения - 
//   Значение     - 
//
Процедура УстановитьПредикат(Предикат, ВидСравнения, Значение) Экспорт
	
	Если Предикат = Неопределено Или ПустаяСтрока(Предикат.ИмяРеквизита) Тогда
		ВызватьИсключение "Ошибочный порядок вызова функций формирования предиката";
	КонецЕсли;
	
	Условие = Новый Структура("ИмяРеквизита, ВидСравнения, Значение",
		Предикат.ИмяРеквизита, ВидСравнения, Значение);
		
	Предикат.Условия.Добавить(Условие);
	
КонецПроцедуры

#КонецОбласти
