
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КонструкторЗапроса(Команда)

	ТекстаЗапросаСтрокой = ТекстЗапроса.ПолучитьТекст();
	Если Не ПустаяСтрока(ТекстаЗапросаСтрокой) Тогда
		КонструкторЗапроса = ПолучитьКонструкторЗапроса(ТекстаЗапросаСтрокой);
		Если КонструкторЗапроса = Неопределено Тогда
			Возврат;
		КонецЕсли;
	Иначе
		КонструкторЗапроса = Новый КонструкторЗапроса;
	КонецЕсли;

	ОписаниеОповещения = Новый ОписаниеОповещения("КонструкторЗапроса_ОповещениеЗакрытияКонструктора", ЭтаФорма);
	КонструкторЗапроса.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура КонструкторЗапроса_ОповещениеЗакрытияКонструктора(Результат, ДополнительныеПараметры) Экспорт
	
	ТекстЗапроса.УстановитьТекст(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Преобразовать(Команда)
	
	ПреобразоватьНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПолучитьКонструкторЗапроса(ТекстЗапроса)
	
	Попытка
		КонструкторЗапроса = Новый КонструкторЗапроса(ТекстЗапроса);
	Исключение
		
		// TODO:
		
		Возврат Неопределено;
		
	КонецПопытки;
	
	Возврат КонструкторЗапроса;
	
	
КонецФункции

&НаСервере
Процедура ПреобразоватьНаСервере()
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса.ПолучитьТекст());
	
	ТочкаОстанова = 1;
	
КонецПроцедуры

#КонецОбласти
