#Область ОбъявлениеТестов

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты
		.ДобавитьТест("ИсключениеИсточникОтсутствует")
		.ДобавитьТест("ИсключениеИсточникПустаяСтрока")
		.ДобавитьТест("ЗапросВТаблицуЗначений")
		.ДобавитьТест("ЗапросВМассив")
		.ДобавитьТест("Первые")
		.ДобавитьТест("Различные")
		.ДобавитьТест("Разрешенные")
		.ДобавитьТест("ИсключениеПолеОтсутствует")
		.ДобавитьТест("ДобавитьПоляССинонимами")
		.ДобавитьТест("ДобавитьНесколькоПолей")
		.ДобавитьТест("ДобавитьНесколькоПолейСПереносомСтроки")
		.ДобавитьТест("ДобавитьПоляССинонимамиИСписком")
		.ДобавитьТест("ВсеПоляДляНеСсылочногоТипа")
		.ДобавитьТест("ВсеПоляДляСсылочногоТипа")
		.ДобавитьТест("ЗапросСУсловием")
		.ДобавитьТест("ЛевоеСоединениеПоИсточникуСтроке")
		.ДобавитьТест("ЛевоеСоединениеПоИсточникуЗапросу")
		.ДобавитьТест("ЛевоеСоединениеБезПредиката")
		.ДобавитьТест("ЛевоеСоединениеНесколькоУсловийВПредикате")
		.ДобавитьТест("ЛевоеСоединениеПредикатЭтоПараметр")
		.ДобавитьТест("ЛевоеСоединениеБезПсевдонимовВСоединении")
		.ДобавитьТест("НесколькоЛевыхСоединений")
		.ДобавитьТест("ВложенныйЗапрос")
		.ДобавитьТест("Порядок")
		.ДобавитьТест("Итоги")
		.ДобавитьТест("АдресныйКлассификаторСлужебный_ТаблицаАдресныхСокращений")
	;
	
КонецПроцедуры

#КонецОбласти

#Область Тесты

#Область Базовые

Процедура ИсключениеИсточникОтсутствует() Экспорт
	
	Предикат = СЗ_Запрос.Предикат()
		.Реквизит("ЭтоГруппа").Равно(Ложь)
		.Получить()
	;
	
	Обработка = Обработки.СЗ_ПроцессорСхемЗапроса.Создать();
	
	ЮТест.ОжидаетЧто(Обработка)
		.Метод("ВТаблицуЗначений")
		.ВыбрасываетИсключение("Источник данных запроса не определен");
	
КонецПроцедуры

Процедура ИсключениеИсточникПустаяСтрока() Экспорт
	
	Предикат = СЗ_Запрос.Предикат()
		.Реквизит("ЭтоГруппа").Равно(Ложь)
		.Получить()
	;

	Запрос = СЗ_Запрос.НовыйЗапрос("")
		.Где(Предикат)
	;
	
	ЮТест.ОжидаетЧто(Запрос)
		.Метод("ВТаблицуЗначений")
		.ВыбрасываетИсключение("Источник данных запроса не определен");
	
КонецПроцедуры

Процедура ЗапросВТаблицуЗначений() Экспорт
	
	ТаблицаЗначений = СЗ_Запрос.НовыйЗапрос("Справочник.Номенклатура")
		.ВТаблицуЗначений()
	;
	
	ЮТест.ОжидаетЧто(ТаблицаЗначений)
		.ИмеетТип("ТаблицаЗначений")
	;
	ЮТест.ОжидаетЧто(ТаблицаЗначений.Количество())
		.Больше(0)
	;
	
КонецПроцедуры

Процедура ЗапросВМассив() Экспорт
	
	Массив = СЗ_Запрос.НовыйЗапрос("Справочник.Номенклатура")
		.ВМассив("Ссылка")
	;
	
	ЮТест.ОжидаетЧто(Массив)
		.ИмеетТип("Массив")
	;
	ЮТест.ОжидаетЧто(Массив.Количество())
		.Больше(0)
	;
	
КонецПроцедуры

Процедура Первые() Экспорт
	
	ТаблицаЗначений = СЗ_Запрос.НовыйЗапрос("Справочник.Номенклатура", 10)
		.ВТаблицуЗначений()
	;

	ЮТест.ОжидаетЧто(ТаблицаЗначений.Количество())
		.Равно(10)
	;
	
КонецПроцедуры

Процедура Различные() Экспорт
	
	ТаблицаЗначений = СЗ_Запрос.НовыйЗапрос("Справочник.Номенклатура",, Истина)
		.ВТаблицуЗначений()
	;
	
КонецПроцедуры

Процедура Разрешенные() Экспорт
	
	ТаблицаЗначений = СЗ_Запрос.НовыйЗапрос("Справочник.Номенклатура",,, Истина)
		.ВТаблицуЗначений()
	;
	
КонецПроцедуры

#КонецОбласти

#Область Поля

// TODO: Поля могут быть выражениями

Процедура ИсключениеПолеОтсутствует() Экспорт
	
	НеправильноеНаименованиеПоля = "йцукен";
	
	Запрос = СЗ_Запрос.НовыйЗапрос("Справочник.Номенклатура")
		.Выбрать(НеправильноеНаименованиеПоля)
	;

	ЮТест.ОжидаетЧто(Запрос)
		.Метод("ВТаблицуЗначений")
		.ВыбрасываетИсключение(
			СтрШаблон("Поле %1 в источнике не определено", НеправильноеНаименованиеПоля));
	
КонецПроцедуры

Процедура ДобавитьПоляССинонимами() Экспорт
	
	ТаблицаЗначений = СЗ_Запрос.НовыйЗапрос("Справочник.Номенклатура")
		.Выбрать(СЗ_Запрос.НовоеПоле("Ссылка",, "СсылкаНоменклатуры"))
		.Выбрать(СЗ_Запрос.НовоеПоле("Наименование",, "НаименованиеНоменклатуры"))
		.ВТаблицуЗначений()
	;

	ЮТест.ОжидаетЧто(ТаблицаЗначений)
		.ИмеетТип("ТаблицаЗначений")
	;
	ЮТест.ОжидаетЧто(ТаблицаЗначений.Количество())
		.Больше(0)
	;
	ЮТест.ОжидаетЧто(ТаблицаЗначений[0])
		.ИмеетСвойство("СсылкаНоменклатуры")
		.ИмеетСвойство("НаименованиеНоменклатуры")
	;
	
КонецПроцедуры

Процедура ДобавитьНесколькоПолей() Экспорт
	
	ТаблицаЗначений = СЗ_Запрос.НовыйЗапрос("Справочник.Номенклатура")
		.Выбрать("Ссылка, Наименование, ЭтоГруппа")
		.ВТаблицуЗначений()
	;

	ЮТест.ОжидаетЧто(ТаблицаЗначений)
		.ИмеетТип("ТаблицаЗначений")
	;
	ЮТест.ОжидаетЧто(ТаблицаЗначений.Количество())
		.Больше(0)
	;
	ЮТест.ОжидаетЧто(ТаблицаЗначений[0])
		.ИмеетСвойство("Ссылка")
		.ИмеетСвойство("Наименование")
		.ИмеетСвойство("ЭтоГруппа")
	;
	
КонецПроцедуры

Процедура ДобавитьНесколькоПолейСПереносомСтроки() Экспорт
	
	ТаблицаЗначений = СЗ_Запрос.НовыйЗапрос("Справочник.Номенклатура")
		.Выбрать("Ссылка, Наименование,
			|ЭтоГруппа")
		.ВТаблицуЗначений()
	;

	ЮТест.ОжидаетЧто(ТаблицаЗначений)
		.ИмеетТип("ТаблицаЗначений")
	;
	ЮТест.ОжидаетЧто(ТаблицаЗначений.Количество())
		.Больше(0)
	;
	ЮТест.ОжидаетЧто(ТаблицаЗначений[0])
		.ИмеетСвойство("Ссылка")
		.ИмеетСвойство("Наименование")
		.ИмеетСвойство("ЭтоГруппа")
	;
	
КонецПроцедуры

Процедура ДобавитьПоляССинонимамиИСписком() Экспорт
	
	ТаблицаЗначений = СЗ_Запрос.НовыйЗапрос("Справочник.Номенклатура")
		.Выбрать(СЗ_Запрос.НовоеПоле("Ссылка",, "СсылкаНоменклатуры"))
		.Выбрать("Наименование КАК НаименованиеНоменклатуры, ЭтоГруппа")
		.ВТаблицуЗначений()
	;

	ЮТест.ОжидаетЧто(ТаблицаЗначений)
		.ИмеетТип("ТаблицаЗначений")
	;
	ЮТест.ОжидаетЧто(ТаблицаЗначений.Количество())
		.Больше(0)
	;
	ЮТест.ОжидаетЧто(ТаблицаЗначений[0])
		.ИмеетСвойство("СсылкаНоменклатуры")
		.ИмеетСвойство("НаименованиеНоменклатуры")
		.ИмеетСвойство("ЭтоГруппа")
	;
	
КонецПроцедуры

Процедура ВсеПоляДляНеСсылочногоТипа() Экспорт
	
	ТаблицаЗначений = СЗ_Запрос.НовыйЗапрос("РегистрСведений.КурсыВалют")
		.ВТаблицуЗначений()
	;

	ЮТест.ОжидаетЧто(ТаблицаЗначений)
		.ИмеетТип("ТаблицаЗначений")
	;
	ЮТест.ОжидаетЧто(ТаблицаЗначений.Количество())
		.Больше(0)
	;
	ЮТест.ОжидаетЧто(ТаблицаЗначений[0])
		.ИмеетСвойство("Валюта")
		.ИмеетСвойство("Курс")
		.ИмеетСвойство("Кратность")
	;
	
КонецПроцедуры

Процедура ВсеПоляДляСсылочногоТипа() Экспорт
	
	ТаблицаЗначений = СЗ_Запрос.НовыйЗапрос("Справочник.Номенклатура")
		.ВыбратьВсе()
		.ВТаблицуЗначений()
	;

	ЮТест.ОжидаетЧто(ТаблицаЗначений)
		.ИмеетТип("ТаблицаЗначений")
	;
	ЮТест.ОжидаетЧто(ТаблицаЗначений.Количество())
		.Больше(0)
	;
	ЮТест.ОжидаетЧто(ТаблицаЗначений[0])
		.ИмеетСвойство("Ссылка")
		.ИмеетСвойство("Наименование")
		.ИмеетСвойство("ЭтоГруппа")
	;
	
КонецПроцедуры

#КонецОбласти

#Область Условия

Процедура ЗапросСУсловием() Экспорт
	
	Предикат = СЗ_Запрос.Предикат()
		.Реквизит("ЭтоГруппа").Равно(Ложь)
	;
	
	ТаблицаЗначений = СЗ_Запрос.НовыйЗапрос("Справочник.Номенклатура")
		.Где(Предикат)
		.ВТаблицуЗначений()
	;
	
	ЮТест.ОжидаетЧто(ТаблицаЗначений)
		.ИмеетТип("ТаблицаЗначений")
	;
	ЮТест.ОжидаетЧто(ТаблицаЗначений.Количество())
		.Больше(0)
	;

КонецПроцедуры

#КонецОбласти

#Область Соединения

Процедура ЛевоеСоединениеПоИсточникуСтроке() Экспорт
	
	ПредикатДляСоединения = СЗ_Запрос.Предикат()
		.Реквизит("НоменклатураСоединение.Ссылка").Равно("Номенклатура.Родитель")
	;
	
	ТаблицаЗначений = СЗ_Запрос.НовыйЗапрос("Справочник.Номенклатура")
		.Выбрать("Номенклатура.Ссылка,
			|НоменклатураСоединение.Ссылка КАК НоменклатураСоединениеСсылка")
		.ЛевоеСоединение("Справочник.Номенклатура КАК НоменклатураСоединение", ПредикатДляСоединения)
		.ВТаблицуЗначений()
	;
	
	ЮТест.ОжидаетЧто(ТаблицаЗначений)
		.ИмеетТип("ТаблицаЗначений")
	;
	ЮТест.ОжидаетЧто(ТаблицаЗначений.Количество())
		.Больше(0)
	;
	ЮТест.ОжидаетЧто(ТаблицаЗначений[0])
		.ИмеетСвойство("Ссылка")
		.ИмеетСвойство("НоменклатураСоединениеСсылка")
	;
	
КонецПроцедуры

Процедура ЛевоеСоединениеПоИсточникуЗапросу() Экспорт
	
	ЗапросДляСоединения = СЗ_Запрос.НовыйЗапрос("Справочник.Номенклатура");
	ПредикатДляСоединения = СЗ_Запрос.Предикат()
		.Реквизит("Ссылка").Равно("Родитель")
	;
	
	ТаблицаЗначений = СЗ_Запрос.НовыйЗапрос("Справочник.Номенклатура")
		.Выбрать("Номенклатура.Ссылка,
			|НоменклатураСоединение.Ссылка КАК НоменклатураСоединениеСсылка")
		.ЛевоеСоединение(ЗапросДляСоединения, ПредикатДляСоединения)
		.ВТаблицуЗначений()
	;

	ЮТест.ОжидаетЧто(ТаблицаЗначений)
		.ИмеетТип("ТаблицаЗначений")
	;
	ЮТест.ОжидаетЧто(ТаблицаЗначений.Количество())
		.Больше(0)
	;
	ЮТест.ОжидаетЧто(ТаблицаЗначений[0])
		.ИмеетСвойство("Ссылка")
		.ИмеетСвойство("НоменклатураСоединениеСсылка")
	;
	
КонецПроцедуры

Процедура ЛевоеСоединениеБезПредиката() Экспорт
	
	ТаблицаЗначений = СЗ_Запрос.НовыйЗапрос("РегистрСведений.ПримененияЕНВД")
		.Выбрать("ПримененияЕНВД.Организация КАК Организация,
			|ПримененияЕНВДСоединение.Склад КАК Склад")
		.ЛевоеСоединение("РегистрСведений.ПримененияЕНВД КАК ПримененияЕНВДСоединение")
		.ВТаблицуЗначений()
	;
	
	ЮТест.ОжидаетЧто(ТаблицаЗначений)
		.ИмеетТип("ТаблицаЗначений")
	;
	ЮТест.ОжидаетЧто(ТаблицаЗначений.Количество())
		.Больше(0)
	;
	ЮТест.ОжидаетЧто(ТаблицаЗначений[0])
		.ИмеетСвойство("Организация")
		.ИмеетСвойство("Склад")
	;
	
КонецПроцедуры

Процедура ЛевоеСоединениеНесколькоУсловийВПредикате() Экспорт
	
	ТаблицаЗначений = СЗ_Запрос.НовыйЗапрос("Справочник.Номенклатура")
		.Выбрать("Номенклатура.Ссылка,
			|НоменклатураСоединение.Ссылка КАК НоменклатураСоединениеСсылка")
		.ЛевоеСоединение("Справочник.Номенклатура КАК НоменклатураСоединение", СЗ_Запрос.Предикат()
			.Реквизит("НоменклатураСоединение.Ссылка").Равно("Номенклатура.Родитель")
			.Реквизит("НоменклатураСоединение.ЭтоГруппа").Равно("ИСТИНА"))
		.ВТаблицуЗначений()
	;
	
	ЮТест.ОжидаетЧто(ТаблицаЗначений)
		.ИмеетТип("ТаблицаЗначений")
	;
	ЮТест.ОжидаетЧто(ТаблицаЗначений.Количество())
		.Больше(0)
	;
	ЮТест.ОжидаетЧто(ТаблицаЗначений[0])
		.ИмеетСвойство("Ссылка")
		.ИмеетСвойство("НоменклатураСоединениеСсылка")
	;
	
КонецПроцедуры

Процедура ЛевоеСоединениеПредикатЭтоПараметр() Экспорт

	// Подготовка
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ЭтоГруппа";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Новый Структура("ИмяПараметра, Значение",
		"Родитель", Выборка.Ссылка));
	
	// Выполнение
	ТаблицаЗначений = СЗ_Запрос.НовыйЗапрос("Справочник.Номенклатура")
		.Выбрать("Номенклатура.Ссылка,
			|НоменклатураСоединение.Ссылка КАК НоменклатураСоединениеСсылка")
		.ЛевоеСоединение("Справочник.Номенклатура КАК НоменклатураСоединение", СЗ_Запрос.Предикат()
			.Реквизит("НоменклатураСоединение.Родитель").Равно("&Родитель"))
		.Параметры(МассивПараметров)
		.ВТаблицуЗначений()
	;
	
	// Проверки
	ЮТест.ОжидаетЧто(ТаблицаЗначений)
		.ИмеетТип("ТаблицаЗначений")
	;
	ЮТест.ОжидаетЧто(ТаблицаЗначений.Количество())
		.Больше(0)
	;
	ЮТест.ОжидаетЧто(ТаблицаЗначений[0])
		.ИмеетСвойство("Ссылка")
		.ИмеетСвойство("НоменклатураСоединениеСсылка")
	;
	
КонецПроцедуры

Процедура ЛевоеСоединениеБезПсевдонимовВСоединении() Экспорт
	
	ТаблицаЗначений = СЗ_Запрос.НовыйЗапрос("Справочник.Номенклатура")
		.Выбрать("Номенклатура.Ссылка, Номенклатура1.Ссылка")
		.ЛевоеСоединение("Справочник.Номенклатура", СЗ_Запрос.Предикат()
			.Реквизит("Ссылка").Равно("Родитель")
			.Реквизит("ЭтоГруппа").Равно("ИСТИНА"))
		.ВТаблицуЗначений()
	;
	
	ЮТест.ОжидаетЧто(ТаблицаЗначений)
		.ИмеетТип("ТаблицаЗначений")
	;
	ЮТест.ОжидаетЧто(ТаблицаЗначений.Количество())
		.Больше(0)
	;
	ЮТест.ОжидаетЧто(ТаблицаЗначений[0])
		.ИмеетСвойство("Ссылка")
		.ИмеетСвойство("Ссылка1")
	;
	
КонецПроцедуры

Процедура НесколькоЛевыхСоединений() Экспорт
	
	ТаблицаЗначений = СЗ_Запрос.НовыйЗапрос("Справочник.Номенклатура")
		.Выбрать("Номенклатура.Ссылка, Номенклатура1.Ссылка, Номенклатура2.Ссылка")
		.ЛевоеСоединение("Справочник.Номенклатура", СЗ_Запрос.Предикат()
			.Реквизит("Ссылка").Равно("Родитель")
			.Реквизит("ЭтоГруппа").Равно("ИСТИНА"))
		.ЛевоеСоединение("Справочник.Номенклатура", СЗ_Запрос.Предикат()
			.Реквизит("Ссылка").Равно("Родитель")
			.Реквизит("ЭтоГруппа").Равно("ИСТИНА"))
		.ВТаблицуЗначений()
	;
	
	ЮТест.ОжидаетЧто(ТаблицаЗначений)
		.ИмеетТип("ТаблицаЗначений")
	;
	ЮТест.ОжидаетЧто(ТаблицаЗначений.Количество())
		.Больше(0)
	;
	ЮТест.ОжидаетЧто(ТаблицаЗначений[0])
		.ИмеетСвойство("Ссылка")
		.ИмеетСвойство("Ссылка1")
		.ИмеетСвойство("Ссылка2")
	;
	
КонецПроцедуры

#КонецОбласти

Процедура ВложенныйЗапрос() Экспорт
	
	ВложенныйЗапрос = СЗ_Запрос.НовыйЗапрос("Справочник.Номенклатура");
	
	ТаблицаЗначений = СЗ_Запрос.НовыйЗапрос(ВложенныйЗапрос)
		.ВТаблицуЗначений()
	;
	
КонецПроцедуры

Процедура Порядок() Экспорт
	
	// Выполнение
	ТаблицаЗначений = СЗ_Запрос.НовыйЗапрос("Справочник.Номенклатура")
		.Упорядочить("ЭтоГруппа, Наименование")
		.ВТаблицуЗначений()
	;

	// Проверки
	// TODO:
	
КонецПроцедуры

Процедура Итоги() Экспорт
	
	ТаблицаЗначений = СЗ_Запрос.НовыйЗапрос("Справочник.Номенклатура")
		// TODO:
		.Итоги()
		.ВТаблицуЗначений()
	;
	
КонецПроцедуры

#Область РеальныеЗапросы

Процедура АдресныйКлассификаторСлужебный_ТаблицаАдресныхСокращений() Экспорт
	
	// Подготовка
	НаименованияАдресныхОбъектов = Новый Массив;
	НаименованияАдресныхОбъектов.Добавить("Абонентский Ящик");

	// Выполнение
	Запрос = СЗ_Запрос.НовыйЗапрос("РегистрСведений.УровниСокращенийАдресныхСведений")
		.Выбрать("Значение КАК Наименование, Сокращение")
		.Сгруппировать("Значение, Сокращение")
		.Упорядочить("Наименование");
	
	Если ТипЗнч(НаименованияАдресныхОбъектов) = Тип("Массив") И НаименованияАдресныхОбъектов.Количество() > 0 Тогда
		Запрос = Запрос
			.Где(СЗ_Запрос.Предикат()
				.Реквизит("Значение").В(НаименованияАдресныхОбъектов));
	КонецЕсли;
	
	Результат = Запрос.ВТаблицуЗначений();
	
	// Проверки
	ЮТест.ОжидаетЧто(Результат)
		.ИмеетТип("ТаблицаЗначений")
	;
	// TODO:
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
