#Область ОписаниеПеременных

&НаКлиенте
Перем СхемаЗапроса;

#КонецОбласти

#Область ПрограммныйИнтерфейс

&НаКлиенте
Процедура УстановитьИсточникДанных(ИсточникДанных, Первые = -1, Различные = Ложь, Разрешенные = Ложь) Экспорт
	СЗ_ПроцессорыСхемЗапросаСлужебныйКлиентСервер.УстановитьИсточникДанных(СхемаЗапроса,
		ИсточникДанных, Первые, Различные, Разрешенные);
КонецПроцедуры

&НаКлиенте
Функция ВТаблицуЗначений() Экспорт
	ТаблицаЗначений = СЗ_ПроцессорыСхемЗапросаСлужебныйВызовСервера
		.ПолучитьРезультатЗапроса(СхемаЗапроса).Выгрузить();
	Возврат ТаблицаЗначений;
КонецФункции

&НаКлиенте
Функция ВМассив(ИмяКолонки) Экспорт
	ТаблицаЗначений = СЗ_ПроцессорыСхемЗапросаСлужебныйВызовСервера
		.ПолучитьРезультатЗапроса(СхемаЗапроса).Выгрузить();
	Возврат ТаблицаЗначений.ВыгрузитьКолонку(ИмяКолонки);
КонецФункции

&НаКлиенте
Функция Первые(Количество) Экспорт
	// TODO:
	Возврат ЭтотОбъект;
КонецФункции

&НаКлиенте
Функция Различные() Экспорт
	// TODO:
	Возврат ЭтотОбъект;
КонецФункции

&НаКлиенте
Функция Разрешенные() Экспорт
	// TODO:
	Возврат ЭтотОбъект;
КонецФункции

&НаКлиенте
Функция Выбрать(Поля) Экспорт
	СЗ_ПроцессорыСхемЗапросаСлужебныйКлиентСервер
		.УстановитьПоляВыборки(СхемаЗапроса, Поля);
	Возврат ЭтотОбъект;
КонецФункции

&НаКлиенте
Функция ВыбратьВсе() Экспорт
	СЗ_ПроцессорыСхемЗапросаСлужебныйКлиентСервер
		.УстановитьВыборВсехПолей(СхемаЗапроса);
	Возврат ЭтотОбъект;
КонецФункции

&НаКлиенте
Функция Где(Предикат) Экспорт
	
	Если ТипЗнч(Предикат) = Тип("Структура") Тогда
		_Предикат = Предикат;
	ИначеЕсли ТипЗнч(Предикат) = Тип("ОбработкаОбъект.СЗ_ПроцессорПредикатов") Тогда
		_Предикат = Предикат.Получить();
	Иначе
		ВызватьИсключение "Неверный тип предиката в методе ""Где""";
	КонецЕсли;
	
	СЗ_ПроцессорыСхемЗапросаСлужебныйКлиентСервер.УстановитьУсловие(СхемаЗапроса, _Предикат);
	Возврат ЭтотОбъект;
КонецФункции

&НаКлиенте
Функция ЛевоеСоединение(ИсточникДанных, Предикат = Неопределено) Экспорт

	// TODO: ИсточникДанных может быть структурой? Что делать в этом случае?
	Если ТипЗнч(ИсточникДанных) = Тип("Строка") Тогда
		_ИсточникДанных = ИсточникДанных;
	ИначеЕсли ТипЗнч(ИсточникДанных) = Тип("ОбработкаОбъект.СЗ_ПроцессорСхемЗапроса") Тогда
		_ИсточникДанных = ИсточникДанных.Получить();
	Иначе
		ВызватьИсключение "ЛевоеСоединение: неверный тип источника данных";
	КонецЕсли;
	
	Если ТипЗнч(Предикат) = Тип("Структура") Или Предикат = Неопределено Тогда
		_Предикат = Предикат;
	ИначеЕсли ТипЗнч(Предикат) = Тип("ОбработкаОбъект.СЗ_ПроцессорПредикатов") Тогда
		_Предикат = Предикат.Получить();
	Иначе
		ВызватьИсключение "ЛевоеСоединение: неверный тип предиката";
	КонецЕсли;

	СЗ_ПроцессорыСхемЗапросаСлужебныйКлиентСервер.ДобавитьСоединение(
		СхемаЗапроса, "Левое", ИсточникДанных, _Предикат);
	Возврат ЭтотОбъект;
КонецФункции

&НаКлиенте
Функция Сгруппировать(Поля) Экспорт
	// TODO:
	Возврат ЭтотОбъект;
КонецФункции

&НаКлиенте
Функция Упорядочить(Поля) Экспорт
	// TODO:
	Возврат ЭтотОбъект;
КонецФункции

&НаКлиенте
Функция Итоги() Экспорт
	// TODO:
	Возврат ЭтотОбъект;
КонецФункции

&НаКлиенте
Функция Параметры(Параметры) Экспорт
	СЗ_ПроцессорыСхемЗапросаСлужебныйКлиентСервер.УстановитьПараметры(СхемаЗапроса, Параметры);
	Возврат ЭтотОбъект;
КонецФункции

&НаКлиенте
Функция Получить() Экспорт
	
	Возврат СхемаЗапроса;
	
КонецФункции

#КонецОбласти
