
#Область ПрограммныйИнтерфейс

// Устанавливает имя реквизита, все последующие условия будут относится к нему
//
// Параметры:
//   Предикат     - 
//   ИмяРеквизита - Строка - имя реквизита
//
Процедура УстановитьИмяРеквизита(Предикат, ИмяРеквизита) Экспорт
	
	Если Предикат = Неопределено Тогда
		Предикат = Новый Структура("ИмяРеквизита, ИмяФункции, ПараметрыФункции, Условия",
			"", "", Новый Массив, Новый Массив);
	КонецЕсли;
	
	Предикат.ИмяРеквизита = ИмяРеквизита;
	
КонецПроцедуры

//
//
Процедура УстановитьРеквизитВыборКогда(Предикат, ИмяРеквизита, ЗначениеИстина, ЗначениеЛожь) Экспорт
	
	Если Предикат = Неопределено Тогда
		Предикат = Новый Структура("ИмяРеквизита, ИмяФункции, ПараметрыФункции, Условия",
			"", "", Новый Массив, Новый Массив);
	КонецЕсли;
	
	ПараметрыФункции = Новый Массив;
	ПараметрыФункции.Добавить(ЗначениеИстина);
	ПараметрыФункции.Добавить(ЗначениеЛожь);
	
	Предикат.ИмяРеквизита = ИмяРеквизита;
	Предикат.ИмяФункции = "ВыборКогда";
	Предикат.ПараметрыФункции = ПараметрыФункции;
	
КонецПроцедуры

//
//
Процедура УстановитьРеквизитВыразить(Предикат, ИмяРеквизита, ОписаниеТипа) Экспорт
	
	Если Предикат = Неопределено Тогда
		Предикат = Новый Структура("ИмяРеквизита, ИмяФункции, ПараметрыФункции, Условия",
			"", "", Новый Массив, Новый Массив);
	КонецЕсли;
	
	ПараметрыФункции = Новый Массив;
	ПараметрыФункции.Добавить(ОписаниеТипа);
	
	Предикат.ИмяРеквизита = ИмяРеквизита;
	Предикат.ИмяФункции = "Выразить";
	Предикат.ПараметрыФункции = ПараметрыФункции;
	
КонецПроцедуры

// Устанавливает вид и значение сравнения для условия
//
// Параметры:
//   Предикат     - ОбработкаОбъект.СхПроцессорПредикатов - 
//                - ФормаКлиентскогоПриложения             - 
//   ВидСравнения - Строка                                 - 
//   Значение     - Производьный                           - 
//
Процедура УстановитьПредикат(Предикат, ВидСравнения, Значение) Экспорт
	
	Если Предикат = Неопределено Или ПустаяСтрока(Предикат.ИмяРеквизита) Тогда
		ВызватьИсключение "Ошибочный порядок вызова функций формирования предиката";
	КонецЕсли;
	
	Условие = Новый Структура("ИмяРеквизита, ВидСравнения, Значение",
		СхОбщегоНазначенийКлиентСервер.ПодготовиьРеквизитСУчетомФункции(Предикат),
		ВидСравнения,
		Значение);
		
	Предикат.Условия.Добавить(Условие);
	
КонецПроцедуры

#КонецОбласти
