#Область ОписаниеПеременных

Перем Предикат;

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция Реквизит(ИмяРеквизита) Экспорт
	СхПроцессорыПредикатовСлужебныйКлиентСервер
		.УстановитьИмяРеквизита(Предикат, ИмяРеквизита);
	Возврат ЭтотОбъект;
КонецФункции

Функция РеквизитВыразить(ИмяРеквизита, ОписаниеТипа) Экспорт
	СхПроцессорыПредикатовСлужебныйКлиентСервер
		.УстановитьРеквизитВыразить(Предикат, ИмяРеквизита, ОписаниеТипа);
	Возврат ЭтотОбъект;
КонецФункции

Функция Равно(Значение) Экспорт
	СхПроцессорыПредикатовСлужебныйКлиентСервер.УстановитьПредикат(Предикат,
		СхПроцессорыПредикатовКлиентСервер.Выражения().Равно, Значение);
	Возврат ЭтотОбъект;
КонецФункции

Функция НеРавно(Значение) Экспорт
	СхПроцессорыПредикатовСлужебныйКлиентСервер.УстановитьПредикат(Предикат,
		СхПроцессорыПредикатовКлиентСервер.Выражения().НеРавно, Значение);
	Возврат ЭтотОбъект;
КонецФункции

Функция Больше(Значение) Экспорт
	СхПроцессорыПредикатовСлужебныйКлиентСервер.УстановитьПредикат(Предикат,
		СхПроцессорыПредикатовКлиентСервер.Выражения().Больше, Значение);
	Возврат ЭтотОбъект;
КонецФункции

Функция Меньше(Значение) Экспорт
	СхПроцессорыПредикатовСлужебныйКлиентСервер.УстановитьПредикат(Предикат,
		СхПроцессорыПредикатовКлиентСервер.Выражения().Меньше, Значение);
	Возврат ЭтотОбъект;
КонецФункции

Функция ВСписке(Значение) Экспорт
	СхПроцессорыПредикатовСлужебныйКлиентСервер.УстановитьПредикат(Предикат,
		СхПроцессорыПредикатовКлиентСервер.Выражения().ВСписке, Значение);
	Возврат ЭтотОбъект;
КонецФункции

Функция НеВСписке(Значение) Экспорт
	СхПроцессорыПредикатовСлужебныйКлиентСервер.УстановитьПредикат(Предикат,
		СхПроцессорыПредикатовКлиентСервер.Выражения().НеВСписке, Значение);
	Возврат ЭтотОбъект;
КонецФункции

Функция Подобно(Значение) Экспорт
	СхПроцессорыПредикатовСлужебныйКлиентСервер.УстановитьПредикат(Предикат,
		СхПроцессорыПредикатовКлиентСервер.Выражения().Подобно, Значение);
	Возврат ЭтотОбъект;
КонецФункции

Функция НеПодобно(Значение) Экспорт
	СхПроцессорыПредикатовСлужебныйКлиентСервер.УстановитьПредикат(Предикат,
		СхПроцессорыПредикатовКлиентСервер.Выражения().НеПодобно, Значение);
	Возврат ЭтотОбъект;
КонецФункции

Функция Между(НачалоИнтервала, ОкончаниеИнтервала) Экспорт
	
	Значения = Новый Массив;
	Значения.Добавить(НачалоИнтервала);
	Значения.Добавить(ОкончаниеИнтервала);
	
	СхПроцессорыПредикатовСлужебныйКлиентСервер.УстановитьПредикат(Предикат,
		СхПроцессорыПредикатовКлиентСервер.Выражения().Между, Значения);
		
	Возврат ЭтотОбъект;
	
КонецФункции

Функция Получить() Экспорт
	
	Возврат Предикат;
	
КонецФункции

#КонецОбласти
