#Область ПрограммныйИнтерфейс

Функция НовыйПроцессорПредикатов() Экспорт
	
	#Если Клиент Тогда
		ПроцессорПредикатов = ПолучитьФорму("Обработка.СЗ_ПроцессорПредикатов.Форма.Форма");
	#Иначе
		ПроцессорПредикатов = Обработки.СЗ_ПроцессорПредикатов.Создать();
	#КонецЕсли
	
	Возврат ПроцессорПредикатов;
	
КонецФункции

Функция Выражения() Экспорт
	
	Выражения = Новый Структура;
	Выражения.Вставить("Равно", "Равно");
	Выражения.Вставить("Больше", "Больше");
	Выражения.Вставить("Меньше", "Меньше");
	Выражения.Вставить("В", "В");

	Возврат Новый ФиксированнаяСтруктура(Выражения);
	
КонецФункции

#КонецОбласти
