
#Область ПрограммныйИнтерфейс

// Возвращает обработку с контекстом и методами наполнения контекста предиката
//
// Возвращаемое значение:
//   - ОбработкаОбъект.СЗ_ПроцессорПредикатов - менеджер для серверного формирования предиката
//   - ФормаКлиентскогоПриложения             - менеджер для клиентского формирования предиката
//
Функция НовыйПроцессорПредикатов() Экспорт
	
	#Если Клиент Тогда
		ПроцессорПредикатов = ПолучитьФорму("Обработка.СЗ_ПроцессорПредикатов.Форма.Форма");
	#Иначе
		ПроцессорПредикатов = Обработки.СЗ_ПроцессорПредикатов.Создать();
	#КонецЕсли
	
	Возврат ПроцессорПредикатов;
	
КонецФункции

// Возвращает структуру-перечисление с типами выражений предикатов
//
// Возвращаемое значение:
//   ФиксированнаяСтруктура - Выражения
//
Функция Выражения() Экспорт
	
	Выражения = Новый Структура;
	Выражения.Вставить("Равно", "Равно");
	Выражения.Вставить("НеРавно", "НеРавно");
	Выражения.Вставить("Больше", "Больше");
	Выражения.Вставить("БольшеИлиРавно", "БольшеИлиРавно");
	Выражения.Вставить("Меньше", "Меньше");
	Выражения.Вставить("МеньшеИлиРавно", "МеньшеИлиРавно");
	Выражения.Вставить("В", "В");

	Возврат Новый ФиксированнаяСтруктура(Выражения);
	
КонецФункции

#КонецОбласти
